# 4.1 У нас є список показань заборгованостей з комунальних послуг наприкінці місяця. Заборгованості можуть бути від'ємними 
# — у нас переплата, чи додатними, якщо необхідно сплатити за рахунками. Напишіть функцію amount_payment, яка приймає 
# на вхід список платежів, підсумовує додатні значення та повертає суму платежу наприкінці місяця.
# -----------------------------------------------------------------------------------------------

def amount_payment(payment):
    payment_all = list(payment)
    sum = 0
    
    for payment in payment_all:
        if payment >= 0:
            sum += payment
        else:
            sum +=0
    return sum 

# 4.2 При аналізі даних часто виникає необхідність позбавитися екстремальних значень, перш ніж почати працювати з даними далі.
# Напишіть функцію prepare_data, яка видаляє з переданого списку найбільше та найменше значення, сортує його в порядку зростання
# і повертає змінений список як результат.
# -----------------------------------------------------------------------------------------------

def prepare_data(data):
    value =list(data)
    value = sorted(value)
    del value[0]
    del value[-1]
    return value
# 4.3 Ми розробляємо кулінарний блог. І в рецептах, при написанні списку інгредієнтів, ми розділяємо їх комами,
# а перед останнім ставимо союз "and", як у прикладі нижче:
# 2 eggs, 1 liter sugar, 1 tsp salt and vinegar
# Напишіть функцію format_ingredients, яка прийматиме на вхід список з інгредієнтів ["2 eggs", "1 liter sugar", "1 tsp salt", "vinegar"]
# та повертатиме рядок зібраний з його елементів в описаний вище спосіб. Ваша функція має вміти обробляти списки будь-якої довжини.
# -----------------------------------------------------------------------------------------------

def format_ingredients(items):
    if len(items) > 2:
        first = items
        list_items = first[-1] 
        list_items1 = first[-2]
        all_list_items = list_items1 + ' and ' + list_items
        first.pop()
        first.pop()
        string_items = ', '.join(first) + ',' + ' ' + all_list_items
        return str(string_items)
    elif len(items) == 2:
        return " and ".join(items)
    else:
        return ''.join(items)
# 4.4 
# -----------------------------------------------------------------------------------------------
