# 4.1 У нас є список показань заборгованостей з комунальних послуг наприкінці місяця. Заборгованості можуть бути від'ємними 
# — у нас переплата, чи додатними, якщо необхідно сплатити за рахунками. Напишіть функцію amount_payment, яка приймає 
# на вхід список платежів, підсумовує додатні значення та повертає суму платежу наприкінці місяця.
# -----------------------------------------------------------------------------------------------

def amount_payment(payment):
    payment_all = list(payment)
    sum = 0
    
    for payment in payment_all:
        if payment >= 0:
            sum += payment
        else:
            sum +=0
    return sum 

# 4.2 При аналізі даних часто виникає необхідність позбавитися екстремальних значень, перш ніж почати працювати з даними далі.
# Напишіть функцію prepare_data, яка видаляє з переданого списку найбільше та найменше значення, сортує його в порядку зростання
# і повертає змінений список як результат.
# -----------------------------------------------------------------------------------------------

def prepare_data(data):
    value =list(data)
    value = sorted(value)
    del value[0]
    del value[-1]
    return value